#include <stdio.h>

int main(){
    float n;
    scanf("%f", &n);

    for (int i = n; i >= 0; i++){
        printf("Число %f входит в диапозон [0, +∞)\n", n);
        break;
    }

    for (int i = n; i < 0; i++){
        printf("Число %f не входит в диапозон [0, +∞)\n", n);
        break;
    }

    for (int i = n; (i >= 5) && (i < 15); i++){
        printf("Число %f входит в диапозон [5, 15)\n", n);
        break;
    }

    for (int i = n; (i < 5) || (i >= 15); i++){
        printf("Число %f не входит в диапозон [5, 15)\n", n);
        break;
    }

    for (int i = n; (i > -1) && (i < 1); i++){
        printf("Число %f входит в диапозон (-1, 1))\n", n);
        break;
    }

    for (int i = n; (i <= -1) || (i >= 1); i++){
        printf("Число %f не входит в диапозон (-1, 1))\n", n);
        break;
    }

    for (int i = n; ((i > -1) && (i < 1)) || ((i >= 5) && (i < 15)); i++){
        printf("Число %f входит в диапозон (-1, 1) U [5; 15)\n", n);
        break;
    }

    for (int i = n; ((i <= -1) || (i >= 1)) && ((i < 5) || (i >= 15)); i++){
        printf("Число %f не входит в диапозон (-1, 1) U [5; 15)\n", n);
        break;
    }

    for (int i = n; ((i > -1) && (i < 1)) || ((i >= 5) && (i < 15)) || (i == 20) || (i == 100) || (i == 1000); i++){
        printf("Число %f входит в диапозон (-1, 1) U [5; 15) U {20, 100, 1000}\n", n);
        break;
    }

    for (int i = n; ((i <= -1) || (i >= 1)) && ((i < 5) || (i >= 15)) && (i != 20) && (i != 100) && (i != 1000); i++){
        printf("Число %f не входит в диапозон (-1, 1) U [5; 15) U {20, 100, 1000}\n", n);
        break;
    }

    return 0;
}
